# **题目：**输出 9*9 乘法口诀表。
for i in range(1,10):
    for j in range(1,10):
        print(str(i) + '乘' + str(j) + '=',i*j)

# 学习它的格式化处理
for i in range(1,10):
    for j in range(1,i+1):
        print('%d*%d=%2d '%(i,j,i*j),end='')
    print()

# %d 就是普通的输出了
# %2d是将数字按宽度为2，采用右对齐方式输出，若数据位数不到2位，则左边补空格。
# %02d，和% 2d差不多，只不过左边补0
# %.2d 输出整形时最少输出2位，如不够前面以0占位。如输出2时变成02。200时只输出200；输出浮点型时（%.2f）小数点后强制2位输出

# 1*1= 1
# 2*1= 2 2*2= 4
# 3*1= 3 3*2= 6 3*3= 9
# 4*1= 4 4*2= 8 4*3=12 4*4=16
# 5*1= 5 5*2=10 5*3=15 5*4=20 5*5=25
# 6*1= 6 6*2=12 6*3=18 6*4=24 6*5=30 6*6=36
# 7*1= 7 7*2=14 7*3=21 7*4=28 7*5=35 7*6=42 7*7=49
# 8*1= 8 8*2=16 8*3=24 8*4=32 8*5=40 8*6=48 8*7=56 8*8=64
# 9*1= 9 9*2=18 9*3=27 9*4=36 9*5=45 9*6=54 9*7=63 9*8=72 9*9=81

