# **题目：**一球从100米高度自由落下，每次落地后反跳回原高度的一半；再落下，求它在第10次落地时，共经过多少米？第10次反弹多高？
high = 100
sum_high = 100
for i in range(10):
    # 0 1 2 3 4 5 6 7 8 9 10 for当计数来用要几次就括号就填几次
    high = high / 2
    sum_high = sum_high + high
    print(high)
print("最终经过：", sum_high, end="米")
# 50.0
# 25.0
# 12.5
# 6.25
# 3.125
# 1.5625
# 0.78125
# 0.390625
# 0.1953125
# 0.09765625
# 最终经过： 199.90234375米

# high = 200.
# total = 100
# for i in range(10):
#     high /= 2
#     total += high
#     print(high / 2)
# print('总长：', total)
# # 50.0
# # 25.0
# # 12.5
# # 6.25
# # 3.125
# # 1.5625
# # 0.78125
# # 0.390625
# # 0.1953125
# # 0.09765625
# # 总长： 299.8046875
