''''''

''' 基础题 '''
# 1.简述必需参数、关键字参数、默认参数、不定长参数的区别

# 2.封装函数，计算传入字符串中单个【数字】、【字母】、【空格] 以及 【其他字符】的个数

# 3.封装函数，判断用户传入的参数（字符串、列表、元组其中之一）长度是否大于5, len(x)>5

# 4.封装函数，计算1到n的和, 并返回结果打印出来; (n为函数参数)
def fn4(n):
    pass

# 5.封装函数，计算n的阶乘, 并返回结果打印出来
def fn5(n):
    pass

# 6.封装函数，传入不定个数的数字，返回所有数字的和, 提示: *args

# 7.封装函数，判断一个年份是不是闰年


''' 进阶题 '''
# 1.写一个函数，识别字符串是否符合python语法的变量名, 返回True或False
#   1.数字字母下划线，且不能以数字开头. 2.不能使用关键字
#
import keyword
print("name" in keyword.kwlist)


# 2.写一个函数计算两个数的最小公倍数; 并返回结果打印出来
def func2(a, b):
    pass

# 3. 年月日分别为自定义函数的参数，判断某一个日期是否为合法的日期;
# 	    如: 2020年12月33日不是合法的日期
# 	        2021年2月29日是不合法的日期

def fn3(year, month, day):
    pass


# 请写出你对今天授课内容最疑惑的地方(或者有困难的知识点)

