''''''

'''
【以下功能都使用函数封装】
提示: 涉及到要返回的题目,请使用return
'''

''' 基础题 '''
# 1.封装函数，计算从1到某个数以内所有奇数的和并返回

# 2.封装函数，判断某个数是否是偶数，返回结果(True或False)

# 3.封装函数，交换某两个变量的值, 并返回结果

# 4,封装函数，将某个字符串中的大写字母转换为小写，小写字母转换为大写，将新的字符串返回【参数设置为默认参数】
# swapcase()


''' 进阶题 '''
# 1.封装函数，比较某两个数的大小，返回较大的一个

# 2.封装函数，判断某个数是否是素数，返回结果(True或False)

# 3.封装函数，计算2-100之间素数的个数，返回结果


''' 挑战题 '''
# 1,封装函数，实现如下要求
# 	例如：输入2，5，则求 2+22+222+2222+22222的和
def fun1(a, n):
    pass


# 2,已知千锋邮箱的用户名只能由数字字母下划线组成，域名为@1000phone.com,
#    封装函数 is_legal_email，判断一个字符串是否是千锋邮箱，是返回True，不是返回False。
#      mail@1000phone.com  是
#      $mail@1000phone.com  不是
#      mail@1000phone.comp  不是
#
# 提示：先找出所有False的情况
#      最后剩下的情况就是True

# 请写出你对今天授课内容最疑惑的地方(或者有困难的知识点)










