
# 6.进制转换
#     a,将二进制1100和10111 分别转成八进制、十进制、十六进制
#        1100(二进制) => 14(八进制) => 12(十进制) => C(十六进制)
#        10111(二进制) => 27(八进制) => 23(十进制) => 17(十六进制)
#
#     b,将下列10进制数转成二进制
# 	      193, 49, 81, 35
#       193(十进制) => 128+64+1 => 11000001(二进制)
#       49(十进制) => 32+16+1 => 110001(二进制)
#       81(十进制) => 64+16+1 => 1010001(二进制)
#       35(十进制) => 32+2+1 => 100011(二进制)
#
#     c,将下列二进制数转成八进制、十进制、十六进制
# 			100001001(二进制) => 411(八进制) => 265(十进制) => 109(十六进制)
# 			1100 1101(二进制) => 315(八进制) => 205(十进制) => CD(十六进制)
#
#     d,把八进制27转换成十六进制
#       27(八进制) => 010111(二进制) => 17(十六进制)
#


