# # 位计算
# a = 3
# print(bin(a))
# # 0b11 0b 是二进制标志
#
# b = 0b1011
# print(b)    # 二进制的表示
# # 11
#
# # 二进制的负数
# c = -8
# print(bin(c))
# # -0b10
#
# # 真正的求负数：
# # -5
# # 5：1 0 1
# # 取反(反码)： 0 1 0
# # 加一： 0 1 1
#
# d = 0o6430  # 八进制了
# print(d)
# # 3352
#
# # 八进制转二进制
# #  6    4      3      0
# # 110  100    011   000
#
# # 16进制
# e = 0x91b
# print(int(e))

# 位运算
'''
&
|
~
^ ：异或
<< 左移
>> 右移
'''

print(3 & 2)
# 2
'''
& 类似 and
1 True 0 False
   0000 0011
 & 0000 0010
  ——————————————
   0000 0010
'''
print(5 | 3)
# 7
'''
| 类似or
'''

# 取反
print(~5)
# -6
'''
5:    0 0 0 0 0 1 0 1
取反： 1 1 1 1 1 0 1 0
第一位是符号位，只要第一位是1的就是负数，第一位是0就是正数


         1 1 1 1 1 0 1 0
减一：    1 1 1 1 1 0 0 1
'''
